[
  {
    "id": 1,
    "name": "Scott Johnston",
    "relationship": "Community Supporter (GoFundMe)",
    "quote": "When I heard Mr Frederico say 'you pissed off the wrong daddy' I was all in. It's good to see a pissed off dad letting the criminals (the ones with ties and without) know that you will never forget me or Logan. God bless you and your family. Enough! If I can do anything going forward, I'm in.",
    "image": "/placeholder-avatar-1.jpg"
  },
  {
    "id": 2,
    "name": "John Carlo",
    "relationship": "Community Supporter (GoFundMe)",
    "quote": "Honestly, there's no words! Your daughter and family deserve justice and I won't stop until you get it! We will get results with these judges and things WILL change or we'll make them.",
    "image": "/placeholder-avatar-2.jpg"
  },
  {
    "id": 3,
    "name": "Gina Gullotta",
    "relationship": "Community Supporter (GoFundMe)",
    "quote": "This could happen to anyone including myself and if we don't all unify as one this insanity will keep happening. I will be a voice for Logan because some degenerate waste of sperm took her voice. Be strong and courageous. Do not be afraid; do not be discouraged, for the Lord your God will be with you wherever you go. - Joshua 1:9",
    "image": "/placeholder-avatar-3.jpg"
  },
  {
    "id": 4,
    "name": "Ryan Nakafuji",
    "relationship": "Community Supporter (GoFundMe)",
    "quote": "Sincere condolences to the Federico family. I support Mr. Federico in fighting for justice on behalf of his daughter, Logan. May God bless the Federico family, and rest in peace, Logan!",
    "image": "/placeholder-avatar-4.jpg"
  },
  {
    "id": 5,
    "name": "Kate Higgins",
    "relationship": "Community Supporter (GoFundMe)",
    "quote": "We stand with you. These judges are acting irresponsibly and putting the public in danger by releasing dangerous criminals back onto the streets. There must be accountability. No one, not even a judge, should be above the law. Justice should protect the innocent, not empower the guilty.",
    "image": "/placeholder-avatar-5.jpg"
  },
  {
    "id": 6,
    "name": "Lana Norris",
    "relationship": "Community Supporter (GoFundMe)",
    "quote": "God bless Logan and her family. Your death will not be in vain, I will make sure of it too! I will support your father as best I can in his journey for justice.",
    "image": "/placeholder-avatar-6.jpg"
  },
  {
    "id": 7,
    "name": "Donald Cameron",
    "relationship": "International Supporter (Tasmania)",
    "quote": "Our thoughts are with all the Federico family from over the seas in Tasmania. Truly tragic.",
    "image": "/placeholder-avatar-7.jpg"
  },
  {
    "id": 8,
    "name": "Toni McGrath",
    "relationship": "Community Supporter (GoFundMe)",
    "quote": "Mr. Federico, I stand with you! Keep speaking loudly!",
    "image": "/placeholder-avatar-8.jpg"
  },
  {
    "id": 9,
    "name": "Shanne Fowler",
    "relationship": "Community Supporter (GoFundMe)",
    "quote": "I am so sorry for your loss. I will continue the fight against a broken system and encourage others to do the same. This should have never happened. God bless the Federico family. Logan will never be forgotten.",
    "image": "/placeholder-avatar-9.jpg"
  }
]
